# 1. Вывести список установленных пакетов в консоли cmd/Pycharm и сделать скрин установленных пакетов
# 2. Установить любую стороннюю библиотеку
# 3. Вывести и сделать скрин нового списка установленных пакетов в консоли cmd/Pycharm
# 4. Удалить установленную библиотеку и проверить, что удалилась
#
# Итогом должно быть три скрина: Первый до установки библиотеки, второй после установки библиотеки,
# третий после удаления

# ИТОГ
# https://online.sbis.ru/page/dialog/74a452b8-4881-489a-b69e-ee362385fb92?inviteduser=bd67dfdf-b74e-4966-85ce-0f154c16282c